class HealthOptionConstants {
  static const List<String> mood = [
    '🙂 ปกติ',
    '😄 มีความสุข',
    '🤩 ตื่นตัว ร่าเริ่ง',
    '🥺 อ่อนไหวกับสิ่งรอบตัว',
    '😶 ไม่อยากทำอะไรทั้งนั้น',
    '😢 เศร้า หดหู่',
    '😤 หงุดหงิดกับสิ่งเล็กน้อย',
    '😭 แปรปรวน ร้องไห้ง่าย',
    '😰 วิตกกังวลหรือเครียดมากกว่าปกติ',
  ];

  static const List<String> symptom = [
    '🩸 ปวดประจำเดือน',
    '⚡ ปวดหลังส่วนล่าง',
    '🦵 ปวดขา',
    '💧 ตัวบวม',
    '🤢 คลื่นไส้',
    '🚽 ท้องผูก',
    '💦 ท้องร่วง',
    '🎈 หน้าอกคัด ตึง หรือเจ็บ',
    '🌬️ ท้องอืด',
    '📈 น้ำหนักขึ้นเล็กน้อย',
    '🔴 มีสิวขึ้น',
    '🤕 ปวดศีรษะหรือไมเกรน',
    '🥱 เหนื่อยง่าย อ่อนเพลีย',
    '🌙 มีการนอนไม่หลับ หรือหลับไม่สนิท',
    '🥄 คลื่นไส้เบื่ออาหาร',
  ];

  static List<String> behaviorChanges = [
    'อยากกินของหวานหรือของเค็มมากขึ้น',
    'อยากอยู่คนเดียว หรือไม่อยากเข้าสังคม',
    'เบื่องานหรือกิจกรรมที่เคยชอบ',
    'มีอาการง่วงบ่อย หรืออยากนอนมากกว่าปกติ',
  ];

  static List<String> dischargeSymptoms = [
    'ใสหรือขาวขุ่นเล็กน้อย',
    'ไม่มีอาการคันหรือระคายเคือง',
    'ขาวสีข้นหรือเป็นก้อนคล้ายแป้งเปียก',
    'คัน แสบ หรือระคายเคืองบริเวณช่องคลอด',
    'ขาวสีเทาหรือขาวอมเทา',
    'สีเขียวหรือเหลืองปนเขียว',
    'สีน้ำตาลหรือมีเลือดปน',
    'ไม่มีตกขาว',
    'คัน แสบ หรือปัสสาวะแสบขัด',
  ];

  static List<String> sexualActivity = [
    'มีเพศสัมพันธ์ แบบป้องกัน',
    'มีเพศสัมพันธ์ แบบไม่ป้องกัน',
    'ไม่มีเพศสัมพันธ์',
  ];
}
